### Final Project Part 2
### Group 3
### Semester- Spring 2024

### Data Loading and Augmentation

In [1]:
import pandas as pd
import numpy as np

Intel MKL WARNING: Support of Intel(R) Streaming SIMD Extensions 4.2 (Intel(R) SSE4.2) enabled only processors has been deprecated. Intel oneAPI Math Kernel Library 2025.0 will require Intel(R) Advanced Vector Extensions (Intel(R) AVX) instructions.
Intel MKL WARNING: Support of Intel(R) Streaming SIMD Extensions 4.2 (Intel(R) SSE4.2) enabled only processors has been deprecated. Intel oneAPI Math Kernel Library 2025.0 will require Intel(R) Advanced Vector Extensions (Intel(R) AVX) instructions.

### Loading the excel File of our dataset-- Mohit

In [3]:
df=pd.read_csv("Hotel_Reservations.csv")

In [3]:
df.head()

,Booking_ID,no_of_adults,no_of_children,no_of_weekend_nights,no_of_week_nights,type_of_meal_plan,required_car_parking_space,room_type_reserved,lead_time,arrival_year,...,arrival_date,market_segment_type,repeated_guest,no_of_previous_cancellations,no_of_previous_bookings_not_canceled,avg_price_per_room,no_of_special_requests,booking_status,name,Customerid
0,INN00001,2,0,1,2,Meal Plan 1,0,Room_Type 1,224,2017,...,2,Offline,0,0,0,65.00,0,Not_Canceled,Tyler Smith,1
1,INN00002,2,0,2,3,Not Selected,0,Room_Type 1,5,2018,...,6,Online,0,0,0,106.68,1,Not_Canceled,Scott Young,2
2,INN00003,1,0,2,1,Meal Plan 1,0,Room_Type 1,1,2018,...,28,Online,0,0,0,60.00,0,Canceled,Heather Meyer,3
3,INN00004,2,0,0,2,Meal Plan 1,0,Room_Type 1,211,2018,...,20,Online,0,0,0,100.00,0,Canceled,Erik Moreno,4
4,INN00005,2,0,1,1,Not Selected,0,Room_Type 1,48,2018,...,11,Online,0,0,0,94.50,0,Canceled,Robert Rollins,5

-- In our original dataset, we didnt have room numbers, employee names and ID. So we planned on generating some room numbers , employee names and ID. So that will give a good outlook while creating our final web application.

#### Generating room numbers- Mohit

In [6]:
df["room_type_reserved"].unique()

array(['Room_Type 1', 'Room_Type 4', 'Room_Type 2', 'Room_Type 6',
       'Room_Type 5', 'Room_Type 7', 'Room_Type 3'], dtype=object)

In [7]:
def generate_room_number(row):
    if row['room_type_reserved'] == "Room_Type 1":
        return np.random.randint(100, 199)
    elif row['room_type_reserved'] == "Room_Type 2":
        return np.random.randint(200, 299)
    elif row['room_type_reserved'] == "Room_Type 3":
        return np.random.randint(300, 399)
    elif row['room_type_reserved'] == "Room_Type 4":
        return np.random.randint(400, 499)
    elif row['room_type_reserved'] == "Room_Type 5":
        return np.random.randint(500, 599)
    elif row['room_type_reserved'] == "Room_Type 6":
        return np.random.randint(600, 699)
    elif row['room_type_reserved'] == "Room_Type 7":
        return np.random.randint(700, 799)
    
        



df['room number'] = df.apply(generate_room_number, axis=1)

In [8]:
df.head()

,Booking_ID,no_of_adults,no_of_children,no_of_weekend_nights,no_of_week_nights,type_of_meal_plan,required_car_parking_space,room_type_reserved,lead_time,arrival_year,...,market_segment_type,repeated_guest,no_of_previous_cancellations,no_of_previous_bookings_not_canceled,avg_price_per_room,no_of_special_requests,booking_status,name,Customerid,room number
0,INN00001,2,0,1,2,Meal Plan 1,0,Room_Type 1,224,2017,...,Offline,0,0,0,65.00,0,Not_Canceled,Tyler Smith,1,135
1,INN00002,2,0,2,3,Not Selected,0,Room_Type 1,5,2018,...,Online,0,0,0,106.68,1,Not_Canceled,Scott Young,2,137
2,INN00003,1,0,2,1,Meal Plan 1,0,Room_Type 1,1,2018,...,Online,0,0,0,60.00,0,Canceled,Heather Meyer,3,174
3,INN00004,2,0,0,2,Meal Plan 1,0,Room_Type 1,211,2018,...,Online,0,0,0,100.00,0,Canceled,Erik Moreno,4,160
4,INN00005,2,0,1,1,Not Selected,0,Room_Type 1,48,2018,...,Online,0,0,0,94.50,0,Canceled,Robert Rollins,5,150

#### Generating Employee id and names -- Sanjana

In [9]:
n_rows = len(df)
emp_info = [
    {'id': 'E1001', 'name': 'Sam', 'role': 'Assistant', 'start': 0, 'end': 5000},
    {'id': 'E1002', 'name': 'Sara', 'role': 'Assistant', 'start': 5000, 'end': 10000},
    {'id': 'E1003', 'name': 'Joshua', 'role': 'Supervisor', 'start': 10000, 'end': 20000},
    {'id': 'E1004', 'name': 'Sarah', 'role': 'Supervisor', 'start': 20000, 'end': 25000},
    {'id': 'E1005', 'name': 'Kent', 'role': 'Manager', 'start': 25000, 'end': 30000},
    {'id': 'E1006', 'name': 'Lara', 'role': 'Assistant', 'start': 30000, 'end': n_rows}
]
emp_df = pd.DataFrame()
for emp in emp_info:
    emp_rows = np.arange(emp['start'], emp['end'])
    emp_data = {'employee id': [emp['id']] * len(emp_rows),
                'employee name': [emp['name']] * len(emp_rows),
                'role': [emp['role']] * len(emp_rows)}
    emp_df = pd.concat([emp_df, pd.DataFrame(emp_data, index=emp_rows)])


df = pd.concat([df, emp_df], axis=1)

In [10]:
df.describe()

,no_of_adults,no_of_children,no_of_weekend_nights,no_of_week_nights,required_car_parking_space,lead_time,arrival_year,arrival_month,arrival_date,repeated_guest,no_of_previous_cancellations,no_of_previous_bookings_not_canceled,avg_price_per_room,no_of_special_requests,Customerid,room number
count,36275.000000,36275.000000,36275.000000,36275.000000,36275.000000,36275.000000,36275.000000,36275.000000,36275.000000,36275.000000,36275.000000,36275.000000,36275.000000,36275.000000,36275.000000,36275.000000
mean,1.844962,0.105279,0.810724,2.204300,0.030986,85.232557,2017.820427,7.423653,15.596995,0.025637,0.023349,0.153411,103.423539,0.619655,18138.000000,220.019655
std,0.518715,0.402648,0.870644,1.410905,0.173281,85.930817,0.383836,3.069894,8.740447,0.158053,0.368331,1.754171,35.089424,0.786236,10471.834844,142.805838
min,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,2017.000000,1.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,1.000000,100.000000
25%,2.000000,0.000000,0.000000,1.000000,0.000000,17.000000,2018.000000,5.000000,8.000000,0.000000,0.000000,0.000000,80.300000,0.000000,9069.500000,132.000000
50%,2.000000,0.000000,1.000000,2.000000,0.000000,57.000000,2018.000000,8.000000,16.000000,0.000000,0.000000,0.000000,99.450000,0.000000,18138.000000,164.000000
75%,2.000000,0.000000,2.000000,3.000000,0.000000,126.000000,2018.000000,10.000000,23.000000,0.000000,0.000000,0.000000,120.000000,1.000000,27206.500000,195.000000
max,4.000000,10.000000,7.000000,17.000000,1.000000,443.000000,2018.000000,12.000000,31.000000,1.000000,13.000000,58.000000,540.000000,5.000000,36275.000000,797.000000

### Creating the correct date format - Yash

In [18]:
df['arrival_date'] = pd.to_datetime(df['arrival_date'], format='%d/%m/%Y')

In [19]:
df['arrival_date']

0       2017-10-02
1       2018-11-06
2       2018-02-28
3       2018-05-20
4       2018-04-11
           ...
36270   2018-08-03
36271   2018-10-17
36272   2018-07-01
36273   2018-04-21
36274   2018-12-30
Name: arrival_date, Length: 36275, dtype: datetime64[ns]

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 36275 entries, 0 to 36274
Data columns (total 25 columns):
 #   Column                                Non-Null Count  Dtype
---  ------                                --------------  -----
 0   Booking_ID                            36275 non-null  object
 1   no_of_adults                          36275 non-null  int64
 2   no_of_children                        36275 non-null  int64
 3   no_of_weekend_nights                  36275 non-null  int64
 4   no_of_week_nights                     36275 non-null  int64
 5   type_of_meal_plan                     36275 non-null  object
 6   required_car_parking_space            36275 non-null  int64
 7   room_type_reserved                    36275 non-null  object
 8   lead_time                             36275 non-null  int64
 9   arrival_year                          36275 non-null  int64
 10  arrival_month                         36275 non-null  int64
 11  arrival_date                          36275 non-null  datetime64[ns]
 12  market_segment_type                   36275 non-null  object
 13  repeated_guest                        36275 non-null  int64
 14  no_of_previous_cancellations          36275 non-null  int64
 15  no_of_previous_bookings_not_canceled  36275 non-null  int64
 16  avg_price_per_room                    36275 non-null  float64
 17  no_of_special_requests                36275 non-null  int64
 18  booking_status                        36275 non-null  object
 19  name                                  36275 non-null  object
 20  Customerid                            36275 non-null  int64
 21  room number                           36275 non-null  int64
 22  employee id                           36275 non-null  object
 23  employee name                         36275 non-null  object
 24  role                                  36275 non-null  object
dtypes: datetime64[ns](1), float64(1), int64(14), object(9)
memory usage: 6.9+ MB

### Decomposing into a seperate employees table -- Sanjana

In [21]:
employees = df[['employee id','employee name', 'role']]

In [22]:
employees

      employee id employee name       role
0           E1001           Sam  Assistant
1           E1001           Sam  Assistant
2           E1001           Sam  Assistant
3           E1001           Sam  Assistant
4           E1001           Sam  Assistant
...           ...           ...        ...
36270       E1006          Lara  Assistant
36271       E1006          Lara  Assistant
36272       E1006          Lara  Assistant
36273       E1006          Lara  Assistant
36274       E1006          Lara  Assistant

[36275 rows x 3 columns]

In [33]:
employees.to_csv('employees.csv', index=False)

#### Creating the customers Table -- Sanjana

In [47]:
customer = df[['Customerid', 'name']].drop_duplicates()

In [35]:
customer.to_csv('customers.csv', index=False)

In [36]:
df.columns

Index(['Booking_ID', 'no_of_adults', 'no_of_children', 'no_of_weekend_nights',
       'no_of_week_nights', 'type_of_meal_plan', 'required_car_parking_space',
       'room_type_reserved', 'lead_time', 'arrival_year', 'arrival_month',
       'arrival_date', 'market_segment_type', 'repeated_guest',
       'no_of_previous_cancellations', 'no_of_previous_bookings_not_canceled',
       'avg_price_per_room', 'no_of_special_requests', 'booking_status',
       'name', 'Customerid', 'room number', 'employee id', 'employee name',
       'role', 'checkout_date', 'payment_date', 'paymentamount',
       'payment type'],
      dtype='object')

### Decomposing into rooms table -- Yash

In [37]:
room = df[['room number', 'room_type_reserved']].drop_duplicates()

In [38]:
### Calculating the checkout date
df['checkout_date'] = df['arrival_date'] + pd.to_timedelta(df['no_of_weekend_nights'] + df['no_of_week_nights'], unit='D')

df.head()

,Booking_ID,no_of_adults,no_of_children,no_of_weekend_nights,no_of_week_nights,type_of_meal_plan,required_car_parking_space,room_type_reserved,lead_time,arrival_year,...,name,Customerid,room number,employee id,employee name,role,checkout_date,payment_date,paymentamount,payment type
0,INN00001,2,0,1,2,Meal Plan 1,0,Room_Type 1,224,2017,...,Tyler Smith,1,135,E1001,Sam,Assistant,2017-10-05,2017-02-20,65.00,card
1,INN00002,2,0,2,3,Not Selected,0,Room_Type 1,5,2018,...,Scott Young,2,137,E1001,Sam,Assistant,2018-11-11,2018-11-01,106.68,card
2,INN00003,1,0,2,1,Meal Plan 1,0,Room_Type 1,1,2018,...,Heather Meyer,3,174,E1001,Sam,Assistant,2018-03-03,2018-02-27,60.00,card
3,INN00004,2,0,0,2,Meal Plan 1,0,Room_Type 1,211,2018,...,Erik Moreno,4,160,E1001,Sam,Assistant,2018-05-22,2017-10-21,100.00,card
4,INN00005,2,0,1,1,Not Selected,0,Room_Type 1,48,2018,...,Robert Rollins,5,150,E1001,Sam,Assistant,2018-04-13,2018-02-22,94.50,card

In [39]:
df["payment_date"]=df['arrival_date'] - pd.to_timedelta(df['lead_time'] , unit='D')

In [40]:
room.to_csv('rooms.csv', index=False)

In [41]:
df["paymentamount"]=df["avg_price_per_room"]

In [42]:
booking_status = df[['Booking_ID', 'booking_status']].drop_duplicates()
booking_status.to_csv('booking_status.csv', index=False)

### Decomposing into hotels table- Yash

In [44]:
df['payment type'] = 'card'

In [45]:
df.columns

Index(['Booking_ID', 'no_of_adults', 'no_of_children', 'no_of_weekend_nights',
       'no_of_week_nights', 'type_of_meal_plan', 'required_car_parking_space',
       'room_type_reserved', 'lead_time', 'arrival_year', 'arrival_month',
       'arrival_date', 'market_segment_type', 'repeated_guest',
       'no_of_previous_cancellations', 'no_of_previous_bookings_not_canceled',
       'avg_price_per_room', 'no_of_special_requests', 'booking_status',
       'name', 'Customerid', 'room number', 'employee id', 'employee name',
       'role', 'checkout_date', 'payment_date', 'paymentamount',
       'payment type'],
      dtype='object')

In [46]:
df.to_csv('hotelsreservation.csv', index=False)

### Loading the data and connecting it to the MySQL Server

In [2]:
import mysql.connector
import pandas as pd

Intel MKL WARNING: Support of Intel(R) Streaming SIMD Extensions 4.2 (Intel(R) SSE4.2) enabled only processors has been deprecated. Intel oneAPI Math Kernel Library 2025.0 will require Intel(R) Advanced Vector Extensions (Intel(R) AVX) instructions.
Intel MKL WARNING: Support of Intel(R) Streaming SIMD Extensions 4.2 (Intel(R) SSE4.2) enabled only processors has been deprecated. Intel oneAPI Math Kernel Library 2025.0 will require Intel(R) Advanced Vector Extensions (Intel(R) AVX) instructions.

### Connecting the dataframe to the mysql connector -- Mohit

In [2]:
import mysql.connector


cnx = mysql.connector.connect(user='root', password='',
                              host='localhost', port=3306)


cursor = cnx.cursor()
cursor.execute("CREATE DATABASE reservepro")

cursor.close()
cnx.close()

In [3]:
import mysql.connector


cnx = mysql.connector.connect(user='root', password='',
                              host='localhost', port=3306,
                              database='reservepro')
cursor = cnx.cursor()

In [4]:
hoteldf=pd.read_csv("hotelsreservation.csv")
hoteldf.columns

Index(['Booking_ID', 'no_of_adults', 'no_of_children', 'no_of_weekend_nights',
       'no_of_week_nights', 'type_of_meal_plan', 'required_car_parking_space',
       'room_type_reserved', 'lead_time', 'arrival_year', 'arrival_month',
       'arrival_date', 'market_segment_type', 'repeated_guest',
       'no_of_previous_cancellations', 'no_of_previous_bookings_not_canceled',
       'avg_price_per_room', 'no_of_special_requests', 'booking_status',
       'name', 'Customerid', 'room number', 'employee id', 'employee name',
       'role', 'checkout_date', 'payment_date', 'paymentamount',
       'payment type'],
      dtype='object')

#### Renaming some of the columns-- Mohit

In [5]:
hoteldf = hoteldf.rename(columns={'employee id': 'employee_id'})
hoteldf = hoteldf.rename(columns={'room number': 'room_number'})

### Populating the Customers Table-- Mohit

In [6]:
cursor.execute('''
    CREATE TABLE customers (
        customer_id INT AUTO_INCREMENT PRIMARY KEY,
        name VARCHAR(50) NOT NULL,
        repeated_guest INT NOT NULL DEFAULT 0,
        no_of_previous_cancellations INT NOT NULL DEFAULT 0
        
    )
''')

In [7]:
for row in hoteldf.itertuples():
    cursor.execute('''
        INSERT INTO customers (name, 
                                    repeated_guest,no_of_previous_cancellations  )
        VALUES ( %s, %s, %s)
        ''',
        (
        row.name,
        row.repeated_guest,
        row.no_of_previous_cancellations,
        ))
    cnx.commit()

#### Populating the Reservations table-- Sanjana

In [58]:
cursor.execute('''
    CREATE TABLE reservations (
        booking_id VARCHAR(20) PRIMARY KEY,
        customer_id INT NOT NULL REFERENCES customers(customer_id),
        roomnumber INT REFERENCES rooms(roomnumber),
        employee_id VARCHAR(20) NOT NULL REFERENCES employees(employee_id),
        no_of_adults INT NOT NULL,
        no_of_children INT,
        no_of_weekend_nights INT,
        no_of_week_nights INT,
        CONSTRAINT positive_adults CHECK (no_of_adults >= 0)
    )
''')

In [59]:
for row in hoteldf.itertuples():
    cursor.execute('''
        SELECT customer_id FROM customers WHERE customer_id   = %s
    ''', (row.Customerid,))
    result = cursor.fetchone()
    if result:
        customer_id = result[0]
        cursor.execute('''
            INSERT INTO reservations (booking_id,
                                        customer_id,
                                        roomnumber,
                                        employee_id,
                                        no_of_adults,
                                        no_of_children,
                                        no_of_weekend_nights,
                                        no_of_week_nights)
            VALUES (%s, %s, %s, %s, %s, %s, %s, %s)
        ''',
        (row.Booking_ID,
         customer_id,
         row.room_number,
         row.employee_id,
         row.no_of_adults,
         row.no_of_children,
         row.no_of_weekend_nights,
         row.no_of_week_nights))
        cnx.commit()
    else:
        print("Customer ID not found for Customerid:", row.Customerid)

### Populating the Checkins table-- Sanjana

In [61]:
cursor.execute('''
    CREATE TABLE Checkins (
    booking_id varchar(20) references reservations(booking_id),
    arrival_date datetime,
    checkoutdate datetime )
''')

In [62]:
for row in hoteldf.itertuples():
    cursor.execute('''
        INSERT INTO checkins (booking_id ,
        arrival_date ,
    checkoutdate   )
        VALUES (%s, %s, %s)
        ''',
                   
        ( row.Booking_ID,
        row.arrival_date,
        row.checkout_date
         
        ))
    cnx.commit()

### Populating Additional requests table --Yash

In [64]:
cursor.execute('''
    CREATE TABLE additional_requests (
        customer_id int references customers(customer_id),
        specialrequests int,
        requiredcarspace int
    )
''')

In [65]:
for row in hoteldf.itertuples():
    cursor.execute('''
        INSERT INTO additional_requests (customer_id, specialrequests,requiredcarspace)
        VALUES (%s, %s,%s)
        ''',
        (row.Customerid,
        row.no_of_special_requests,
        row.required_car_parking_space))
    cnx.commit()

### Creating the restaurants table for the chefs -- Yash

In [67]:
cursor.execute('''
    CREATE TABLE restaurants (
        booking_id varchar(20) references reservations(booking_id),
        mealtype varchar (20) NOT NULL
    )
''')

In [68]:
for row in hoteldf.itertuples():
    cursor.execute('''
        INSERT INTO restaurants (booking_id,mealtype)
        VALUES (%s, %s)
        ''',
        (row.Booking_ID,
        row.type_of_meal_plan ))
    cnx.commit()

### Creating Payment table -- Mohit

In [72]:
cursor.execute("DROP TABLE IF EXISTS Payment")

In [73]:
cursor.execute('''
    CREATE TABLE Payment (
        booking_id VARCHAR(20) REFERENCES reservations (booking_id),
        paymenttype VARCHAR(20) NOT NULL,
        paymentamount FLOAT(10) NOT NULL,
        paymentdate DATETIME NOT NULL,
        CONSTRAINT positive_payment_amount CHECK (paymentamount >= 0)
    )
''')

In [26]:
hoteldf.columns

Index(['Booking_ID', 'no_of_adults', 'no_of_children', 'no_of_weekend_nights',
       'no_of_week_nights', 'type_of_meal_plan', 'required_car_parking_space',
       'room_type_reserved', 'lead_time', 'arrival_year', 'arrival_month',
       'arrival_date', 'market_segment_type', 'repeated_guest',
       'no_of_previous_cancellations', 'no_of_previous_bookings_not_canceled',
       'avg_price_per_room', 'no_of_special_requests', 'booking_status',
       'name', 'Customerid', 'room_number', 'employee_id', 'employee name',
       'role', 'checkout_date', 'payment_date', 'paymentamount',
       'payment type'],
      dtype='object')

In [74]:
hoteldf = hoteldf.rename(columns={'payment type': 'paymenttype', 'employeename': 'employeename'})

In [75]:
for row in hoteldf.itertuples():
    cursor.execute('''
        INSERT INTO payment (booking_id,paymenttype,paymentamount,paymentdate )
        VALUES (%s, %s,%s, %s)
        ''',
        (row.Booking_ID,
         row.paymenttype,
        row.paymentamount,
        row.payment_date))
    cnx.commit()

In [29]:
employee=pd.read_csv("employees.csv")

In [30]:
employee.head()

  employee id employee name       role
0       E1001           Sam  Assistant
1       E1001           Sam  Assistant
2       E1001           Sam  Assistant
3       E1001           Sam  Assistant
4       E1001           Sam  Assistant

### Populating Staff Table-- Sanjana

In [77]:
cursor.execute('''
    CREATE TABLE  staff (
    booking_id VARCHAR(20) REFERENCES reservations (booking_id),
        employee_id varchar(20) NOT NULL,
        name varchar(20) ,
        role varchar(20) 
    )
''')

In [78]:
employee = employee.rename(columns={'employee id': 'id', 'employee name': 'name'})

In [79]:
for row in employee.itertuples():
    cursor.execute('''
        INSERT INTO staff (employee_id,name,role )
        VALUES (%s, %s,%s)
        ''',
        (row.id,
         row.name,
        row.role))
    cnx.commit()

### Populating the Room_Details table for room information -- Sanjana

In [80]:
room=pd.read_csv("rooms.csv")

In [52]:
room.head()

   room number room_type_reserved
0          135        Room_Type 1
1          137        Room_Type 1
2          174        Room_Type 1
3          160        Room_Type 1
4          150        Room_Type 1

In [84]:
room = room.rename(columns={'room number': 'roomnumber'})

In [81]:
cursor.execute("DROP TABLE IF EXISTS rooms")

In [82]:
cursor.execute('''
    CREATE TABLE IF NOT EXISTS Room_Details (
    booking_id VARCHAR(20) REFERENCES reservations (booking_id),
        roomnumber INT not null,
        room_type_reserved VARCHAR(50)
    )
''')

In [85]:
for row in room.itertuples():
    cursor.execute('''
        INSERT INTO Room_Details (roomnumber,room_type_reserved )
        VALUES (%s, %s)
        ''',
        (row.roomnumber,
         row.room_type_reserved))
    cnx.commit()

### Queries which we want to display on our WebPage

### 1. For the Restaurant to Prepare the Meals selected by the customers.-- Mohit

In [5]:
cursor.execute('''
    SELECT r.booking_id, c.name, r.roomnumber, r1.mealtype
    FROM reservations r
    JOIN customers c ON r.customer_id = c.customer_id
    JOIN restaurants r1 ON r1.booking_id = r.booking_id
''')
rows = cursor.fetchall()
columns = [desc[0] for desc in cursor.description]


df = pd.DataFrame(rows, columns=columns)

print(df)

      booking_id            name  roomnumber      mealtype
0       INN00001     Tyler Smith         135   Meal Plan 1
1       INN00002     Scott Young         137  Not Selected
2       INN00003   Heather Meyer         174   Meal Plan 1
3       INN00004     Erik Moreno         160   Meal Plan 1
4       INN00005  Robert Rollins         150  Not Selected
...          ...             ...         ...           ...
36270   INN36271   Henry Hancock         486   Meal Plan 1
36271   INN36272      Jason Kidd         186   Meal Plan 1
36272   INN36273  Mitchell Pratt         122   Meal Plan 1
36273   INN36274   Daniel Dennis         163  Not Selected
36274   INN36275  Jennifer Walsh         123   Meal Plan 1

[36275 rows x 4 columns]

### 2. Customers who require Parking Spaces -Yash

In [6]:
cursor.execute('''
   select  r.booking_id, c.name,r.roomnumber,p.carparking,ch.arrival_date,ch.checkoutdate
from reservations r join customers c on r.customer_id=c.customer_id join ParkingSpace p join Checkins ch on p.booking_id=ch.booking_id
on p.booking_id=r.booking_id;


''')
rows = cursor.fetchall()
columns = [desc[0] for desc in cursor.description]


df = pd.DataFrame(rows, columns=columns)

print(df)

      booking_id              name  roomnumber  carparking arrival_date  \
0       INN00001       Tyler Smith         135           0   2017-10-02
1       INN00002       Scott Young         137           0   2018-11-06
2       INN00003     Heather Meyer         174           0   2018-02-28
3       INN00004       Erik Moreno         160           0   2018-05-20
4       INN00005    Robert Rollins         150           0   2018-04-11
...          ...               ...         ...         ...          ...
36270   INN36232  Micheal Martinez         148           0   2018-06-28
36271   INN36240      Marc Solomon         453           0   2018-02-27
36272   INN36243     Ruben Simmons         159           0   2017-09-24
36273   INN36254    Ryan Henderson         179           0   2018-05-17
36274   INN36260    Daniel Walters         153           0   2017-09-09

      checkoutdate
0       2017-10-05
1       2018-11-11
2       2018-03-03
3       2018-05-22
4       2018-04-13
...            ...
36270   2018-06-30
36271   2018-02-28
36272   2017-09-30
36273   2018-05-20
36274   2017-09-12

[36275 rows x 6 columns]

### 3. Customers Checkin and Checkout Dates For The Reception -- Sanjana

In [7]:
cursor.execute('''
  
SELECT r.booking_id, c.name, r.roomnumber, ch.arrival_date,ch.checkoutdate
    FROM reservations r
    JOIN customers c ON r.customer_id = c.customer_id
    join checkins ch  on ch.booking_id=r.booking_id
    order by arrival_date asc;



''')
rows = cursor.fetchall()
columns = [desc[0] for desc in cursor.description]


df = pd.DataFrame(rows, columns=columns)

print(df)

      booking_id               name  roomnumber arrival_date checkoutdate
0       INN30226       Kevin Vaughn         100   2017-07-01   2017-07-03
1       INN30908     Courtney Evans         103   2017-07-01   2017-07-03
2       INN31969      Shane Gardner         177   2017-07-01   2017-07-03
3       INN32067  Courtney Williams         107   2017-07-01   2017-07-03
4       INN32758   Michele Williams         111   2017-07-01   2017-07-03
...          ...                ...         ...          ...          ...
36270   INN13467       Erica Werner         113   2018-12-31   2019-01-02
36271   INN14290    Larry Fernandez         193   2018-12-31   2019-01-02
36272   INN15722    Jeffrey Carroll         183   2018-12-31   2019-01-03
36273   INN16054      Rebecca Moore         477   2018-12-31   2019-01-03
36274   INN17644       Brenda Price         166   2018-12-31   2019-01-03

[36275 rows x 5 columns]

### 4. Blacklisted Customers Who have cancelled more than 5 times, are resulting in hotel's revenue loss- Mohit, Sanjana and Yash.

In [8]:
cursor.execute('''
  
With cte as(
SELECT r.customer_id, c.name AS customer_name,c.no_of_previous_cancellations as cancount
FROM reservations r 
JOIN customers c ON r.customer_id = c.customer_id 
JOIN BookingStatus bs ON bs.booking_id = r.booking_id
WHERE bs.booking_status = 'Canceled'
GROUP BY r.customer_id, c.name
order by c.no_of_previous_cancellations desc)
select customer_id as BlacklistedID, customer_name as blacklisted_name, cancount
from cte
where cancount>5;




''')
rows = cursor.fetchall()
columns = [desc[0] for desc in cursor.description]


df = pd.DataFrame(rows, columns=columns)

print(df)

   BlacklistedID blacklisted_name  cancount
0          12098     Vincent Knox        13
1          12110     Matthew Lutz        13
2          16278     Steven Reyes        13
3          30834     Robin Foster        13

#### 5. Total Revenue loss id  avg price of room is 200$'s -Sanjana

In [9]:
cursor.execute('''
  


SELECT CONCAT('$', 
    (SELECT COUNT(*) FROM BookingStatus WHERE booking_status = 'Canceled') * 200
) AS Total_Revenue_Loss;



''')
rows = cursor.fetchall()
columns = [desc[0] for desc in cursor.description]


df = pd.DataFrame(rows, columns=columns)

print(df)

  Total_Revenue_Loss
0           $2377000